from prepars.verb import verbProcessing
import pytest


@pytest.mark.parametrize(
    "input, expected",
    [
        ("میخورد", "می‌خورد"),
        ("میخورد", "می‌خورد"),
        ("میرفت", "می‌رفت"),
        ("می‌رفت", "می‌رفت")
    ],
)
def test_verbs(input, expected):
    assert verbProcessing().fixVerbs(input) == expected
    assert True


samples = """
میخورد
می رفت
میرفت
نمیرفت داشتندمیرفتند
میآجیدم داشتیممیخوردیم
داشتیمیخوردی آراسته است نمیرفتهاست
نرفتهاند آراستهاست
داشتهاست میآراستهاست داشتهاممیرفتهام
داشتهمیرفته نمیآراسته بوده ام
می آزرده بوده اند خواهمخورد
رفتهبودم نمیرفتهبودیم
داشتممیرفتهبودم
داشتم میرفته بودم
رفتهبودهام
میرفتهبودهام
داشتهایم می رفته بودهایم
نمیروبم میروبم نمی روبم
دارد نمی روبد
خواهیمرفت رفتهباشد
می رفته باشم نرفته بوده باشد
میرفته بوده باشد
"""
